/* 
    캡슐화

    관련성 있는 데이터와 메서드를 객체 안에 구현하고,
    객체의 밖에서 알아야 할 필요가 없는 내무 멤버를 숨기는 것


    접근 제한자

    C#의 접근 제한자는 5가지

    private : 내부에서만 접근을 허용

    protected : 내부에서의 접근 및 파생 클래스에서만 접근을 허용

    public : 내부, 파생 클래스 및 외부에서도 접근 허용, 공용 클래스

    internal : 동일한 어셈블리 내에서 public에 준하는 접근 허용, 다른 어셈블리에서 접근 불가

    internal protected : 동일 어셈블리 내에서 저의된 클래스나 다른 어셈블리라도 파생 클래인 경우에 한해 접근 가능
                         protected internal 로도 지정 가능

    제한자를 지정하지 않은 경우

    class 에 경우 internal로 지정

    class 내부멤버는 private로 지정

 */

 /* 정보 은닉

    멤버 변수를 감추기 위해 public Get/Set 메서드를 지정

    멤버 변수에 public 사용하지 않는 이유?
        => 멤버변수를 사용하는 코드에 부적절한 값 입력 시 발생하는 오류에 대한 유지보수

    정보은닉의 원칙
        1. 특별한 이유를 제외하고는 필드를 절대 public으로 선언하지 않는다.
        2. 접근이 필요할 때는 접근자/설정자 메서드를 만들어 외부에서 접근하는 경로를 클래스 개발자의 관리하에 둔다.
    
  */